---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsType.EndConnectionType
source: html/d36ce655-b97d-d332-e949-acea34fb3311.htm
---
# Autodesk.Revit.DB.Architecture.StairsType.EndConnectionType Property

The join style between a run and landing.

## Syntax (C#)
```csharp
public StairsEndConnectionType EndConnectionType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration